In [294]:
import pandas as pd
import numpy as np
import datetime

# Lectura y Normalizaci처n de datos

In [295]:
data = pd.read_json('../data/datos_ventas_clientes.json')

In [296]:
data.head()

                                        dados_vendas
0  {'Data de venda': '06/06/2022', 'Cliente': ['@...
1  {'Data de venda': '07/06/2022', 'Cliente': ['I...
2  {'Data de venda': '08/06/2022', 'Cliente': ['I...
3  {'Data de venda': '09/06/2022', 'Cliente': ['J...
4  {'Data de venda': '10/06/2022', 'Cliente': ['M...

In [297]:
data = pd.json_normalize(data['dados_vendas'])

In [298]:
data.head()

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JO찾O Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

# Transformaci처n de datos

Eliminando datos en listas dentro del DataFrame.

In [299]:
data = data.explode(['Cliente', 'Valor da compra'])
data.reset_index(inplace = True, drop = True)
data.head()

  Data de venda             Cliente Valor da compra
0    06/06/2022     @ANA _LUCIA 321        R$ 836,5
1    06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2    06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3    06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4    07/06/2022  Isabely JOanes 738       R$ 825,31

Verificando tipos de datos.

In [300]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes

## Datos num챕ricos

Identificando columnas num챕ricas y Transformando la columna num챕rica a tipo num챕rico.

In [301]:
data['Valor da compra'] = data['Valor da compra'].apply(lambda x: x.replace('R$ ','').replace(',', '.'))
data['Valor da compra'] = data['Valor da compra'].astype(np.float64)

In [302]:
data.head()

  Data de venda             Cliente  Valor da compra
0    06/06/2022     @ANA _LUCIA 321           836.50
1    06/06/2022  DieGO ARMANDIU 210           573.33
2    06/06/2022  DieGO ARMANDIU 210           392.80
3    06/06/2022  DieGO ARMANDIU 210           512.34
4    07/06/2022  Isabely JOanes 738           825.31

In [303]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

## Datos de texto

In [304]:
data.head()

  Data de venda             Cliente  Valor da compra
0    06/06/2022     @ANA _LUCIA 321           836.50
1    06/06/2022  DieGO ARMANDIU 210           573.33
2    06/06/2022  DieGO ARMANDIU 210           392.80
3    06/06/2022  DieGO ARMANDIU 210           512.34
4    07/06/2022  Isabely JOanes 738           825.31

Manipulando los textos de la columna Cliente para que el resultado sean los nombres de los clientes en letras min첬sculas.

In [305]:
data['Cliente'] = data['Cliente'].str.lower()

Eliminando de la columna Cliente caracteres especiales y n첬meros.

In [306]:
data.Cliente.unique()

array(['@ana _lucia 321', 'diego armandiu 210', 'isabely joanes 738',
       'jo찾o gabriel 671', 'julya meireles 914', 'maria julia 444',
       'pedro pasco 812', 'paulo castro 481', 'thiago fritzz 883'],
      dtype=object)

In [307]:
data['Cliente'] = data['Cliente'].str.replace('찾','a')
data['Cliente'] = data['Cliente'].str.replace("[^a-zA-Z\-\']", ' ', regex = True).replace('(?<!\w)-(?!\w)', ' ', regex = True)
data['Cliente'] = data['Cliente'].str.strip()

<>:2: SyntaxWarning: invalid escape sequence '\-'
<>:2: SyntaxWarning: invalid escape sequence '\w'
<>:2: SyntaxWarning: invalid escape sequence '\-'
<>:2: SyntaxWarning: invalid escape sequence '\w'
C:\Users\Usuario\AppData\Local\Temp\ipykernel_4216\132467885.py:2: SyntaxWarning: invalid escape sequence '\-'
  data['Cliente'] = data['Cliente'].str.replace("[^a-zA-Z\-\']", ' ', regex = True).replace('(?<!\w)-(?!\w)', ' ', regex = True)
C:\Users\Usuario\AppData\Local\Temp\ipykernel_4216\132467885.py:2: SyntaxWarning: invalid escape sequence '\w'
  data['Cliente'] = data['Cliente'].str.replace("[^a-zA-Z\-\']", ' ', regex = True).replace('(?<!\w)-(?!\w)', ' ', regex = True)

In [308]:
data.head(2)

  Data de venda         Cliente  Valor da compra
0    06/06/2022      ana  lucia           836.50
1    06/06/2022  diego armandiu           573.33

In [309]:
data.Cliente.unique()

array(['ana  lucia', 'diego armandiu', 'isabely joanes', 'joao gabriel',
       'julya meireles', 'maria julia', 'pedro pasco', 'paulo castro',
       'thiago fritzz'], dtype=object)

## Datos de tiempo

In [310]:
data.head()

  Data de venda         Cliente  Valor da compra
0    06/06/2022      ana  lucia           836.50
1    06/06/2022  diego armandiu           573.33
2    06/06/2022  diego armandiu           392.80
3    06/06/2022  diego armandiu           512.34
4    07/06/2022  isabely joanes           825.31

In [311]:
data['Data de venda'] = pd.to_datetime(data['Data de venda'])

In [312]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

# Finalizaci처n

In [314]:
data

   Data de venda         Cliente  Valor da compra
0     2022-06-06      ana  lucia           836.50
1     2022-06-06  diego armandiu           573.33
2     2022-06-06  diego armandiu           392.80
3     2022-06-06  diego armandiu           512.34
4     2022-07-06  isabely joanes           825.31
5     2022-07-06  isabely joanes           168.07
6     2022-07-06  isabely joanes           339.18
7     2022-07-06  isabely joanes           314.69
8     2022-08-06  isabely joanes           682.05
9     2022-08-06    joao gabriel           386.34
10    2022-08-06  julya meireles           622.65
11    2022-08-06  julya meireles           630.79
12    2022-09-06  julya meireles           390.30
13    2022-09-06     maria julia           759.16
14    2022-09-06     maria julia           334.47
15    2022-09-06     maria julia           678.78
16    2022-10-06     maria julia           314.24
17    2022-10-06     pedro pasco           311.15
18    2022-10-06    paulo castro           899.16
19    2022-10-06   thiago fritzz           885.24

In [321]:
subset = pd.DataFrame(data.groupby('Cliente')['Valor da compra'].sum())

In [325]:
subset

                Valor da compra
Cliente
ana  lucia               836.50
diego armandiu          1478.47
isabely joanes          2329.30
joao gabriel             386.34
julya meireles          1643.74
maria julia             2086.65
paulo castro             899.16
pedro pasco              311.15
thiago fritzz            885.24

In [339]:
ganador = subset.loc[subset['Valor da compra'].idxmax()]

In [342]:
ganador

Valor da compra    2329.3
Name: isabely joanes, dtype: float64

In [344]:
print(f'El ganador/a es {ganador.name} con un total de ${ganador["Valor da compra"]}.')

El ganador/a es isabely joanes con un total de $2329.3.